Revit 2027 API
StructuralFramingUtils.CanSetEndReference Method
 Determines if a reference can be set for the given end of the framing element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CanSetEndReference(
	FamilyInstance familyInstance,
	int end
)
Public Shared Function CanSetEndReference (
	familyInstance As FamilyInstance,
	end As Integer
) As Boolean
public:
static bool CanSetEndReference(
	FamilyInstance^ familyInstance,
	int end
)
static member CanSetEndReference :
        familyInstance : FamilyInstance *
        end : int -> bool
Parameters
familyInstance FamilyInstance
 The FamilyInstance, which must be of a structural framing category, non-concrete and joined at the given end.
end Int32
 The index of the end (0 for the start, 1 for the end).
Return Value
Boolean
 True if reference can be set for the given end of the framing element.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  end must be 0 or 1.
See Also
Reference
StructuralFramingUtils Class
Autodesk.Revit.DB.Structure Namespace